package dynamic.algorithm.shares;
/*
    【714 买卖股票的最佳时机含手续费】给定一个整数数组 prices，其中 prices[i]表示第 i 天的股票价格 ；整数 fee 代表了交易股票的手续费用。
                                你可以无限次地完成交易，但是你每笔交易都需要付手续费。如果你已经购买了一个股票，
                                在卖出它之前你就不能再继续购买股票了。返回获得利润的最大值。
                                注意：这里的一笔交易指买入持有并卖出股票的整个过程，每笔交易你只需要为支付一次手续费。
    【示例 1】
            输入：prices = [1, 3, 2, 8, 4, 9], fee = 2
            输出：8
            解释：能够达到的最大利润:
            在此处买入 prices[0] = 1
            在此处卖出 prices[3] = 8
            在此处买入 prices[4] = 4
            在此处卖出 prices[5] = 9
            总利润: ((8 - 1) - 2) + ((9 - 4) - 2) = 8
    【示例 2】
            输入：prices = [1,3,7,5,10,3], fee = 3
            输出：6
    ===============================================================================================================
    【解题思路】一只股票可以买卖多次，但是有手续费
            1、定义 dp 数组：
              （1）dp[i][0]: 表示第 i 天是持有股票的状态（持有 = 保持 第 i 天前 买入股票的状态 + 第 i 天买入）
              （2）dp[i][1]: 表示第 i 天是不持有股票的状态（不持有 = 保持 第 i 天前 卖出股票的状态 + 第 i 天卖出）
            2、递推公式：
              （1）dp[i][0] = max(dp[i - 1][0], dp[i - 1][1] - prices[i])
              （2）dp[i][1] = max(dp[i - 1][0], dp[i - 1][0] + prices[i] - fee)【卖出需要减去手续费】
            3、初始化 dp 数组：
              （1）dp[0][0] = - prices[0];
              （2）dp[0][1] = 0;
            4、遍历顺序：从前到后
            5、打印 dp 数组
 */
public class MaxProfit6 {
    public int maxProfit(int[] prices, int fee) {
        int[][] dp = new int[prices.length][2];

        dp[0][0] = - prices[0];

        for (int i = 1; i < prices.length; i++) {
            for (int j = 0; j < 2; j++) {
                dp[i][0] = Math.max(dp[i - 1][0], dp[i - 1][1] - prices[i]);
                dp[i][1] = Math.max(dp[i - 1][1], dp[i - 1][0] + prices[i] - fee);
            }
        }
        return dp[prices.length - 1][1];
    }
}
